labs/lab-2/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org-mode Lab</title>
<!-- 2017-01-11 Wed 20:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kanav Gupta" />
</head>
<body>
<div id="content">
<h1 class="title">Org-mode Lab</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Files and Keys</a></li>
<li><a href="#sec-2">2. Navigation and Commands</a></li>
<li><a href="#sec-3">3. Help</a></li>
<li><a href="#sec-4">4. Bonus</a></li>
<li><a href="#sec-5">5. Org 1</a></li>
<li><a href="#sec-6">6. Markup and Plane List</a></li>
<li><a href="#sec-7">7. Source Blocks</a></li>
<li><a href="#sec-8">8. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Files and Keys</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>C-x,C-f,&lt;hello.txt&gt;
</li>
<li>C-h r
</li>
<li>C-&lt;space&gt;&lt;up-arrow&gt;,M-w
</li>
<li>C-g , q
</li>
<li>C-y,C-y,C-y,C-y,C-y 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Navigation and Commands</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>C-p,C-p,C-p,C-p,C-p,C-f,C-f,C-f,C-f,C-n,C-n,C-n
</li>
<li>M-v,M-f,M-f,M-f,C-b,C-b,C-b,C-b,C-b 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Help</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>C-h k , C-x C-c
runs the save-buffers-kill-terminal command. C-x C-c runs the command save-buffers-kill-terminal, which is an
interactive compiled Lisp function in `files.el'.
It is bound to C-x C-c, &lt;menu-bar&gt; &lt;file&gt; &lt;exit-emacs&gt;.
</li>

<li>C-h f , dired
dired is an interactive autoloaded Lisp function in 'dired.el'.
It is bound to C-x d , &lt;menu-bar&gt;&lt;file&gt;&lt;dired&gt;.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Bonus</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>M-x doctor
</li>

<li>Conversation
I am the psychotherapist.  Please, describe your problems.  Each time
</li>
</ul>
<p>
you are finished talking, type RET twice.
</p>

<p>
What do you think?
</p>

<p>
hello
</p>

<p>
How do you do?  What brings you to see me?
</p>

<p>
I have fever
</p>

<p>
Maybe you should consult a medical doctor; I am a psychotherapist. 
</p>

<p>
I don't understand.
</p>

<p>
You can't do anything then?
</p>

<p>
Perhaps your life has something to do with this.
</p>

<p>
what is your good name
</p>

<p>
What makes you believe what is my good name?
</p>

<p>
what is your name
</p>

<p>
Is it because of your plans that you say what is my name?
</p>

<p>
Good Bye! You Don't know anything
</p>

<p>
Possibly the people you hang around with have something to do with
this.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Org 1</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Markup and Plane List</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><b>bold</b>
</li>
<li><i>italic</i>
</li>
<li><code>code</code>
</li>
<li><code>verbatim</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Source Blocks</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
#lang racket
(provide ring-area)
;;; purpose : Find area of a ring with given inner and outer radius.
;;; usage: (ring-area 2 1) =&gt; 9.426
;;; contract : number? number?  -&gt; number?

(define ring-area
     (lambda (outer-radius inner-radius)
	  (* 3.142 (- (* outer-radius outer-radius) (* inner-radius inner-radius)))))
</pre>

<pre class="example">
#lang racket
(provide even-out)
;;; purpose : Print first 20 even integers
;;; contract: . -&gt; list?

(define 20even
	 (list '(0 2 4 6 8 10 12 14 16 18 20 22 24 26 28 30 32 34 36 38)))
</pre>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Links</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="#sec-6">Markups and Plane List</a> 
</li>
<li><a href="http://pascal.iiit.ac.in/~itws2/docs/labs/emacs-orgmode/index.html#sec-3-2-4">Lab Page</a>
</li>
<li><a href="./hello.txt">hello.txt</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kanav Gupta</p>
<p class="date">Created: 2017-01-11 Wed 20:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
